stm32-rs/stm32f4xx-hal/src/timer.rs
    pub trait WithPwmCommon: General {
        const CH_NUMBER: u8;
        const COMP_CH_NUMBER: u8;
        fn read_cc_value(channel: u8) -> u32;
        fn set_cc_value(channel: u8, value: u32);
        fn enable_channel(channel: u8, b: bool);
        fn set_channel_polarity(channel: u8, p: Polarity);
        fn set_nchannel_polarity(channel: u8, p: Polarity);
    }

    pub trait Advanced: WithPwmCommon {
        fn enable_nchannel(channel: u8, b: bool);
        fn set_dtg_value(value: u8);
        fn read_dtg_value() -> u8;
        fn idle_state(channel: u8, comp: bool, s: IdleState);
    }

    pub trait WithPwm: WithPwmCommon {
        fn preload_output_channel_in_mode(&mut self, channel: Channel, mode: Ocm);
        fn start_pwm(&mut self);
    }

    pub trait MasterTimer: General {
        type Mms;
        fn master_mode(&mut self, mode: Self::Mms);
    }
}
pub(crate) use sealed::{Advanced, General, MasterTimer, WithPwm, WithPwmCommon};

pub trait Instance:
    crate::Sealed + rcc::Enable + rcc::Reset + rcc::BusTimerClock + General
{
}

macro_rules! hal {
    ($($TIM:ty: [
        $Timer:ident,
        $bits:ty,
        $(dmar: $memsize:ty,)?
        $(c: ($CNUM:ident, $cnum:literal $(, $aoe:ident)?),)?
        $(m: $timbase:ident,)?
    ],)+) => {
        $(
            impl Instance for $TIM { }
            pub type $Timer = Timer<$TIM>;

            impl General for $TIM {
                type Width = $bits;

                #[inline(always)]
                fn max_auto_reload() -> u32 {
                    <$bits>::MAX as u32
                }
                #[inline(always)]
                unsafe fn set_auto_reload_unchecked(&mut self, arr: u32) {
                    self.arr.write(|w| w.bits(arr))
                }
                #[inline(always)]
                fn set_auto_reload(&mut self, arr: u32) -> Result<(), Error> {
                    // Note: Make it impossible to set the ARR value to 0, since this
                    // would cause an infinite loop.
                    if arr > 0 && arr <= Self::max_auto_reload() {
                        Ok(unsafe { self.set_auto_reload_unchecked(arr) })
                    } else {
                        Err(Error::WrongAutoReload)
                    }
                }
                #[inline(always)]
                fn read_auto_reload() -> u32 {
                    let tim = unsafe { &*<$TIM>::ptr() };
                    tim.arr.read().bits()
                }
                #[inline(always)]
                fn enable_preload(&mut self, b: bool) {
                    self.cr1.modify(|_, w| w.arpe().bit(b));
                }
                #[inline(always)]
                fn enable_counter(&mut self) {
                    self.cr1.modify(|_, w| w.cen().set_bit());
                }
                #[inline(always)]
                fn disable_counter(&mut self) {
                    self.cr1.modify(|_, w| w.cen().clear_bit());
                }
                #[inline(always)]
                fn is_counter_enabled(&self) -> bool {
                    self.cr1.read().cen().is_enabled()
                }
                #[inline(always)]
                fn reset_counter(&mut self) {
                    self.cnt.reset();
                }
                #[inline(always)]
                fn set_prescaler(&mut self, psc: u16) {
                    self.psc.write(|w| w.psc().bits(psc) );
                }
                #[inline(always)]
                fn read_prescaler(&self) -> u16 {
                    self.psc.read().psc().bits()
                }
                #[inline(always)]
                fn trigger_update(&mut self) {
                    self.cr1.modify(|_, w| w.urs().set_bit());
                    self.egr.write(|w| w.ug().set_bit());
                    self.cr1.modify(|_, w| w.urs().clear_bit());
                }
                #[inline(always)]
                fn clear_interrupt_flag(&mut self, event: Event) {
                    self.sr.write(|w| unsafe { w.bits(0xffff & !event.bits()) });
                }
                #[inline(always)]
                fn listen_interrupt(&mut self, event: Event, b: bool) {
                    if b {
                        self.dier.modify(|r, w| unsafe { w.bits(r.bits() | event.bits()) });
                    } else {
                        self.dier.modify(|r, w| unsafe { w.bits(r.bits() & !event.bits()) });
                    }
                }
                #[inline(always)]
                fn get_interrupt_flag(&self) -> Event {
                    Event::from_bits_truncate(self.sr.read().bits())
                }
                #[inline(always)]
                fn read_count(&self) -> Self::Width {
                    self.cnt.read().bits() as Self::Width
                }
                #[inline(always)]
                fn start_one_pulse(&mut self) {
                    self.cr1.modify(|_, w| unsafe { w.bits(1 << 3) }.cen().set_bit());
                }
                #[inline(always)]
                fn start_no_update(&mut self) {
                    self.cr1.modify(|_, w| w.cen().set_bit().udis().set_bit());
                }
                #[inline(always)]
                fn cr1_reset(&mut self) {
                    self.cr1.reset();
                }
                #[inline(always)]
                fn cnt_reset(&mut self) {
                    self.cnt.reset();
                }
            }

            $(with_dmar!($TIM, $memsize);)?

            $(
                impl WithPwmCommon for $TIM {
                    const CH_NUMBER: u8 = $cnum;
                    const COMP_CH_NUMBER: u8 = $cnum;

                    #[inline(always)]
                    fn read_cc_value(c: u8) -> u32 {
                        let tim = unsafe { &*<$TIM>::ptr() };
                        if c < Self::CH_NUMBER {
                            tim.ccr[c as usize].read().bits()
                        } else {
                            0
                        }
                    }

                    #[inline(always)]
                    fn set_cc_value(c: u8, value: u32) {
                        let tim = unsafe { &*<$TIM>::ptr() };
                        if c < Self::CH_NUMBER {
                            #[allow(unused_unsafe)]
                            tim.ccr[c as usize].write(|w| unsafe { w.bits(value) })
                        }
                    }

                    #[inline(always)]
                    fn enable_channel(c: u8, b: bool) {
                        let tim = unsafe { &*<$TIM>::ptr() };
                        if c < Self::CH_NUMBER {
                            unsafe { bb::write(&tim.ccer, c*4, b); }
                        }
                    }

                    #[inline(always)]
                    fn set_channel_polarity(c: u8, p: Polarity) {
                        let tim = unsafe { &*<$TIM>::ptr() };
                        if c < Self::CH_NUMBER {
                            unsafe { bb::write(&tim.ccer, c*4 + 1, p == Polarity::ActiveLow); }
                        }
                    }

                    #[inline(always)]
                    fn set_nchannel_polarity(c: u8, p: Polarity) {
                        let tim = unsafe { &*<$TIM>::ptr() };
                        if c < Self::COMP_CH_NUMBER {
                            unsafe { bb::write(&tim.ccer, c*4 + 3, p == Polarity::ActiveLow); }
                        }
                    }
                }

                $(
                    impl Advanced for $TIM {
                        fn enable_nchannel(c: u8, b: bool) {
                            let $aoe = ();
                            let tim = unsafe { &*<$TIM>::ptr() };
                            if c < Self::COMP_CH_NUMBER {
                                unsafe { bb::write(&tim.ccer, c*4 + 2, b); }
                            }
                        }
                        fn set_dtg_value(value: u8) {
                            let tim = unsafe { &*<$TIM>::ptr() };
                            tim.bdtr.modify(|_,w| unsafe { w.dtg().bits(value) });
                        }
                        fn read_dtg_value() -> u8 {
                            let tim = unsafe { &*<$TIM>::ptr() };
                            tim.bdtr.read().dtg().bits()
                        }
                        fn idle_state(c: u8, comp: bool, s: IdleState) {
                            let tim = unsafe { &*<$TIM>::ptr() };
                            if !comp && (c < Self::CH_NUMBER) {
                                unsafe { bb::write(&tim.cr2, c*2 + 8, s == IdleState::Set); }
                            }
                            if comp && (c < Self::COMP_CH_NUMBER) {
                                unsafe { bb::write(&tim.cr2, c*2 + 9, s == IdleState::Set); }
                            }
                        }
                    }
                )?

                with_pwm!($TIM: $CNUM $(, $aoe)?);
                unsafe impl<const C: u8> PeriAddress for CCR<$TIM, C> {
                    #[inline(always)]
                    fn address(&self) -> u32 {
                        &self.0.ccr[C as usize] as *const _ as u32
                    }

